000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. GOBS-PROGRAM.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600     01 RESPONSE PIC X(1).
000700
000800 PROCEDURE DIVISION.
000900     DISPLAY "Gob's Program:  Y/N?".
001000     ACCEPT RESPONSE.
001100     IF (RESPONSE = "y") OR (RESPONSE = "Y") THEN
001200         PERFORM UNTIL 0 = 1
001300             DISPLAY "Penus " WITH NO ADVANCING
001400         END-PERFORM
001500     END-IF.
